# Análise Exploratória de Dados (EDA)

Este notebook realiza uma análise exploratória de dados para:

- Verificar o número de linhas e colunas do banco de dados.
- Conferir tipos de variáveis (numéricas, categóricas, textuais).
- Calcular estatísticas descritivas iniciais (média, mediana, mínimo, máximo, distribuição de frequências).
- Identificar valores ausentes e inválidos.

In [11]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import mysql.connector

# Conexão com o banco de dados
connection = mysql.connector.connect(
    host='192.168.196.63',
    user='root',
    password='ABC!abc123',
    database='projeto1'
)

QUERY = """
DESCRIBE pars;

"""
cursor = connection.cursor(dictionary=True)
cursor.execute(QUERY)
data = cursor.fetchall()
df = pd.DataFrame(data)
print("Estrutura da tabela 'pars':")
display(df)

Estrutura da tabela 'pars':

         Field           Type Null Key Default Extra
0    PA_CODUNI    varchar(20)  YES        None
1    PA_GESTAO    varchar(20)  YES        None
2    PA_CONDIC    varchar(20)  YES        None
3     PA_UFMUN    varchar(10)  YES        None
4     PA_REGCT    varchar(20)  YES        None
5    PA_INCOUT    varchar(20)  YES        None
6    PA_INCURG    varchar(20)  YES        None
7     PA_TPUPS    varchar(20)  YES        None
8    PA_TIPPRE    varchar(20)  YES        None
9    PA_MN_IND    varchar(20)  YES        None
10  PA_CNPJCPF    varchar(20)  YES        None
11  PA_CNPJMNT    varchar(20)  YES        None
12  PA_CNPJ_CC    varchar(20)  YES        None
13      PA_MVM    varchar(20)  YES        None
14      PA_CMP    varchar(20)  YES        None
15  PA_PROC_ID    varchar(30)  YES        None
16    PA_TPFIN    varchar(20)  YES        None
17   PA_SUBFIN    varchar(20)  YES        None
18   PA_NIVCPL    varchar(20)  YES        None
19  PA_DOCORIG    varchar(30)  YES        None
20  PA_AUTORIZ    varchar(30)  YES        None
21   PA_CNSMED    varchar(20)  YES        None
22   PA_CBOCOD    varchar(20)  YES        None
23   PA_MOTSAI    varchar(20)  YES        None
24    PA_OBITO    varchar(10)  YES        None
25   PA_ENCERR    varchar(10)  YES        None
26   PA_PERMAN    varchar(10)  YES        None
27     PA_ALTA    varchar(10)  YES        None
28   PA_TRANSF    varchar(10)  YES        None
29   PA_CIDPRI    varchar(20)  YES        None
30   PA_CIDSEC    varchar(20)  YES        None
31   PA_CIDCAS    varchar(20)  YES        None
32   PA_CATEND    varchar(20)  YES        None
33    PA_IDADE            int  YES        None
34    IDADEMIN            int  YES        None
35    IDADEMAX            int  YES        None
36  PA_FLIDADE     varchar(5)  YES        None
37     PA_SEXO     varchar(5)  YES        None
38  PA_RACACOR    varchar(10)  YES        None
39   PA_MUNPCN    varchar(20)  YES        None
40   PA_QTDPRO            int  YES        None
41   PA_QTDAPR            int  YES        None
42   PA_VALPRO  decimal(15,2)  YES        None
43   PA_VALAPR  decimal(15,2)  YES        None
44    PA_UFDIF    varchar(10)  YES        None
45    PA_MNDIF    varchar(10)  YES        None
46  PA_DIF_VAL  decimal(15,2)  YES        None
47  NU_VPA_TOT  decimal(15,2)  YES        None
48   NU_PA_TOT  decimal(15,2)  YES        None
49   PA_INDICA    varchar(20)  YES        None
50   PA_CODOCO    varchar(20)  YES        None
51     PA_FLQT    varchar(10)  YES        None
52     PA_FLER    varchar(10)  YES        None
53    PA_ETNIA    varchar(10)  YES        None
54    PA_VL_CF  decimal(15,2)  YES        None
55    PA_VL_CL  decimal(15,2)  YES        None
56   PA_VL_INC  decimal(15,2)  YES        None
57    PA_SRV_C    varchar(10)  YES        None
58      PA_INE    varchar(20)  YES        None
59  PA_NAT_JUR    varchar(20)  YES        None

In [12]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import mysql.connector

# Conexão com o banco de dados
connection = mysql.connector.connect(
    host='192.168.196.63',
    user='root',
    password='ABC!abc123',
    database='projeto1'
)

QUERY = """
DESCRIBE s_cid;

"""
cursor = connection.cursor(dictionary=True)
cursor.execute(QUERY)
data = cursor.fetchall()
df = pd.DataFrame(data)
print("Estrutura da tabela 's_cid':")
display(df)

Estrutura da tabela 's_cid':

        Field      Type Null Key Default Extra
0      cd_cod   char(4)  YES        None
1         opc   char(1)  YES        None
2         cat   char(1)  YES        None
3      subcat   char(1)  YES        None
4    cd_descr  char(50)  YES        None
5   restrsexo   char(1)  YES        None
6  campos_rad   char(3)  YES        None
7     estadio   char(1)  YES        None
8  repete_rad   char(1)  YES        None

In [13]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import mysql.connector

# Conexão com o banco de dados
connection = mysql.connector.connect(
    host='192.168.196.63',
    user='root',
    password='ABC!abc123',
    database='projeto1'
)

QUERY = """
DESCRIBE tb_municip;

"""
cursor = connection.cursor(dictionary=True)
cursor.execute(QUERY)
data = cursor.fetchall()
df = pd.DataFrame(data)
print("Estrutura da tabela 'tb_municip':")
display(df)

Estrutura da tabela 'tb_municip':

         Field      Type Null Key Default Extra
0   co_municip   char(6)  YES        None
1   co_municdv   char(7)  YES        None
2    co_status   char(7)  YES        None
3      co_tipo   char(7)  YES        None
4      ds_nome  char(48)  YES        None
5   ds_nomepad  char(48)  YES        None
6    ds_observ   char(1)  YES        None
7    co_regiao   char(1)  YES        None
8        co_uf   char(2)  YES        None
9     co_alter   char(1)  YES        None
10  co_alterdv   char(1)  YES        None
11  in_capital   char(1)  YES        None
12  in_amazleg   char(1)  YES        None
13   in_semiar   char(1)  YES        None
14  in_frontzn   char(1)  YES        None
15   dt_instal   char(4)  YES        None
16    dt_extin   char(4)  YES        None
17   co_sucess   char(6)  YES        None
18    nu_ordem   char(1)  YES        None
19   nu_ordmap   char(1)  YES        None
20  nu_latitud  char(19)  YES        None
21   nu_longit  char(18)  YES        None
22  nu_altitud   char(4)  YES        None
23     nu_area  char(10)  YES        None

In [14]:
import matplotlib.pyplot as plt
import seaborn as sns
import pandas as pd
import mysql.connector

# Conexão com o banco de dados
connection = mysql.connector.connect(
    host='192.168.196.63',
    user='root',
    password='ABC!abc123',
    database='projeto1'
)

QUERY = """
DESCRIBE tb_sigtaw;

"""
cursor = connection.cursor(dictionary=True)
cursor.execute(QUERY)
data = cursor.fetchall()
df = pd.DataFrame(data)
print("Estrutura da tabela 'tb_sigtaw':")
display(df)

Estrutura da tabela 'tb_sigtaw':

     Field       Type Null Key Default Extra
0   ip_cod   char(10)  YES        None
1  ip_dscr  char(150)  YES        None